cmsis-svd/cmsis-svd/data/STMicro/STM32H723.svd
        <register>
          <name>SDCMR</name>
          <displayName>SDCMR</displayName>
          <description>This register contains the command issued
          when the SDRAM device is accessed. This register is used
          to initialize the SDRAM device, and to activate the
          Self-refresh and the Power-down modes. As soon as the
          MODE field is written, the command will be issued only to
          one or to both SDRAM banks according to CTB1 and CTB2
          command bits. This register is the same for both SDRAM
          banks.</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Command mode These bits define the
              command issued to the SDRAM device. Note: When a
              command is issued, at least one Command Target Bank
              bit ( CTB1 or CTB2) must be set otherwise the command
              will be ignored. Note: If two SDRAM banks are used,
              the Auto-refresh and PALL command must be issued
              simultaneously to the two devices with CTB1 and CTB2
              bits set otherwise the command will be ignored. Note:
              If only one SDRAM bank is used and a command is
              issued with its associated CTB bit set, the other CTB
              bit of the unused bank must be kept to
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CTB2</name>
              <description>Command Target Bank 2 This bit indicates
              whether the command will be issued to SDRAM Bank 2 or
              not.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTB1</name>
              <description>Command Target Bank 1 This bit indicates
              whether the command will be issued to SDRAM Bank 1 or
              not.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRFS</name>
              <description>Number of Auto-refresh These bits define
              the number of consecutive Auto-refresh commands
              issued when MODE = 011. ....</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MRD</name>
              <description>Mode Register definition This 14-bit
              field defines the SDRAM Mode Register content. The
              Mode Register is programmed using the Load Mode
              Register command. The MRD[13:0] bits are also used to
              program the extended mode register for mobile
              SDRAM.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRTR</name>
          <displayName>SDRTR</displayName>
          <description>This register sets the refresh rate in
          number of SDCLK clock cycles between the refresh cycles
          by configuring the Refresh Timer Count value.Examplewhere
          64 ms is the SDRAM refresh period.The refresh rate must
          be increased by 20 SDRAM clock cycles (as in the above
          example) to obtain a safe margin if an internal refresh
          request occurs when a read request has been accepted. It
          corresponds to a COUNT value of 0000111000000 (448). This
          13-bit field is loaded into a timer which is decremented
          using the SDRAM clock. This timer generates a refresh
          pulse when zero is reached. The COUNT value must be set
          at least to 41 SDRAM clock cycles.As soon as the
          FMC_SDRTR register is programmed, the timer starts
          counting. If the value programmed in the register is 0,
          no refresh is carried out. This register must not be
          reprogrammed after the initialization procedure to avoid
          modifying the refresh rate.Each time a refresh pulse is
          generated, this 13-bit COUNT field is reloaded into the
          counter.If a memory access is in progress, the
          Auto-refresh request is delayed. However, if the memory
          access and Auto-refresh requests are generated
          simultaneously, the Auto-refresh takes precedence. If the
          memory access occurs during a refresh operation, the
          request is buffered to be processed when the refresh is
          complete.This register is common to SDRAM bank 1 and bank
          2.</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRE</name>
              <description>Clear Refresh error flag This bit is
              used to clear the Refresh Error Flag (RE) in the
              Status Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COUNT</name>
              <description>Refresh Timer Count This 13-bit field
              defines the refresh rate of the SDRAM device. It is
              expressed in number of memory clock cycles. It must
              be set at least to 41 SDRAM clock cycles (0x29).
              Refresh rate = (COUNT + 1) x SDRAM frequency clock
              COUNT = (SDRAM refresh period / Number of rows) -
              20</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REIE</name>
              <description>RES Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDSR</name>
          <displayName>SDSR</displayName>
          <description>SDRAM Status register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RE</name>
              <description>Refresh error flag An interrupt is
              generated if REIE = 1 and RE = 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODES1</name>
              <description>Status Mode for Bank 1 These bits define
              the Status Mode of SDRAM Bank 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODES2</name>
              <description>Status Mode for Bank 2 These bits define
              the Status Mode of SDRAM Bank 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
