cmsis-svd/cmsis-svd/data/STMicro/STM32H723.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x58004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC_TAMP_STAMP_CSS_LSE</name>
        <description>RTC tamper, timestamp</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>RTC_WKUP</name>
        <description>RTC Wakeup interrupt</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>RTC_ALARM</name>
        <description>RTC alarms (A and B)</description>
        <value>41</value>
      </interrupt>
      <registers>
        <register>
          <name>RTC_TR</name>
          <displayName>RTC_TR</displayName>
          <description>The RTC_TR is the calendar time shadow
          register. This register must be written in initialization
          mode only. Refer to Calendar initialization and
          configuration on page9 and Reading the calendar on
          page10.This register is write protected. The write access
          procedure is described in RTC register write protection
          on page9.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SU</name>
              <description>Second units in BCD format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ST</name>
              <description>Second tens in BCD format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MNU</name>
              <description>Minute units in BCD format</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MNT</name>
              <description>Minute tens in BCD format</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HU</name>
              <description>Hour units in BCD format</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HT</name>
              <description>Hour tens in BCD format</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PM</name>
              <description>AM/PM notation</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_DR</name>
          <displayName>RTC_DR</displayName>
          <description>The RTC_DR is the calendar date shadow
          register. This register must be written in initialization
          mode only. Refer to Calendar initialization and
          configuration on page9 and Reading the calendar on
          page10.This register is write protected. The write access
          procedure is described in RTC register write protection
          on page9.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00002101</resetValue>
          <fields>
            <field>
              <name>DU</name>
              <description>Date units in BCD format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DT</name>
              <description>Date tens in BCD format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MU</name>
              <description>Month units in BCD format</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MT</name>
              <description>Month tens in BCD format</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDU</name>
              <description>Week day units</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>YU</name>
              <description>Year units in BCD format</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>YT</name>
              <description>Year tens in BCD format</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_CR</name>
          <displayName>RTC_CR</displayName>
          <description>RTC control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WUCKSEL</name>
              <description>Wakeup clock selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEDGE</name>
              <description>Time-stamp event active edge TSE must be
              reset when TSEDGE is changed to avoid unwanted TSF
              setting.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFCKON</name>
              <description>RTC_REFIN reference clock detection
              enable (50 or 60Hz) Note: PREDIV_S must be
              0x00FF.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPSHAD</name>
              <description>Bypass the shadow registers Note: If the
              frequency of the APB clock is less than seven times
              the frequency of RTCCLK, BYPSHAD must be set to
              1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMT</name>
              <description>Hour format</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALRAE</name>
              <description>Alarm A enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALRBE</name>
              <description>Alarm B enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTE</name>
              <description>Wakeup timer enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSE</name>
              <description>timestamp enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALRAIE</name>
              <description>Alarm A interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALRBIE</name>
              <description>Alarm B interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTIE</name>
              <description>Wakeup timer interrupt
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIE</name>
              <description>Time-stamp interrupt
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD1H</name>
              <description>Add 1 hour (summer time change) When
              this bit is set outside initialization mode, 1 hour
              is added to the calendar time. This bit is always
              read as 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SUB1H</name>
              <description>Subtract 1 hour (winter time change)
              When this bit is set outside initialization mode, 1
              hour is subtracted to the calendar time if the
              current hour is not 0. This bit is always read as 0.
              Setting this bit has no effect when current hour is
              0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BKP</name>
              <description>Backup This bit can be written by the
              user to memorize whether the daylight saving time
              change has been performed or not.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COSEL</name>
              <description>Calibration output selection When COE=1,
              this bit selects which signal is output on RTC_CALIB.
              These frequencies are valid for RTCCLK at 32.768 kHz
              and prescalers at their default values (PREDIV_A=127
              and PREDIV_S=255). Refer to Section24.3.15:
              Calibration clock output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POL</name>
              <description>Output polarity This bit is used to
              configure the polarity of RTC_ALARM
              output</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSEL</name>
              <description>Output selection These bits are used to
              select the flag to be routed to RTC_ALARM
              output</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COE</name>
              <description>Calibration output enable This bit
              enables the RTC_CALIB output</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITSE</name>
              <description>timestamp on internal event
              enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_ISR</name>
          <displayName>RTC_ISR</displayName>
          <description>This register is write protected (except for
          RTC_ISR[13:8] bits). The write access procedure is
          described in RTC register write protection on
          page9.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>ALRAWF</name>
              <description>Alarm A write flag This bit is set by
              hardware when Alarm A values can be changed, after
              the ALRAE bit has been set to 0 in RTC_CR. It is
              cleared by hardware in initialization
              mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALRBWF</name>
              <description>Alarm B write flag This bit is set by
              hardware when Alarm B values can be changed, after
              the ALRBE bit has been set to 0 in RTC_CR. It is
              cleared by hardware in initialization
              mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUTWF</name>
              <description>Wakeup timer write flag This bit is set
              by hardware up to 2 RTCCLK cycles after the WUTE bit
              has been set to 0 in RTC_CR, and is cleared up to 2
              RTCCLK cycles after the WUTE bit has been set to 1.
              The wakeup timer values can be changed when WUTE bit
              is cleared and WUTWF is set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHPF</name>
              <description>Shift operation pending This flag is set
              by hardware as soon as a shift operation is initiated
              by a write to the RTC_SHIFTR register. It is cleared
              by hardware when the corresponding shift operation
              has been executed. Writing to the SHPF bit has no
              effect.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INITS</name>
              <description>Initialization status flag This bit is
              set by hardware when the calendar year field is
              different from 0 (Backup domain reset
              state).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSF</name>
              <description>Registers synchronization flag This bit
              is set by hardware each time the calendar registers
              are copied into the shadow registers (RTC_SSRx,
              RTC_TRx and RTC_DRx). This bit is cleared by hardware
              in initialization mode, while a shift operation is
              pending (SHPF=1), or when in bypass shadow register
              mode (BYPSHAD=1). This bit can also be cleared by
              software. It is cleared either by software or by
              hardware in initialization mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INITF</name>
              <description>Initialization flag When this bit is set
              to 1, the RTC is in initialization state, and the
              time, date and prescaler registers can be
              updated.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INIT</name>
              <description>Initialization mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALRAF</name>
              <description>Alarm A flag This flag is set by
              hardware when the time/date registers (RTC_TR and
              RTC_DR) match the Alarm A register (RTC_ALRMAR). This
              flag is cleared by software by writing
              0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALRBF</name>
              <description>Alarm B flag This flag is set by
              hardware when the time/date registers (RTC_TR and
              RTC_DR) match the Alarm B register (RTC_ALRMBR). This
              flag is cleared by software by writing
              0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTF</name>
              <description>Wakeup timer flag This flag is set by
              hardware when the wakeup auto-reload counter reaches
              0. This flag is cleared by software by writing 0.
              This flag must be cleared by software at least 1.5
              RTCCLK periods before WUTF is set to 1
              again.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSF</name>
              <description>Time-stamp flag This flag is set by
              hardware when a time-stamp event occurs. This flag is
              cleared by software by writing 0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSOVF</name>
              <description>Time-stamp overflow flag This flag is
              set by hardware when a time-stamp event occurs while
              TSF is already set. This flag is cleared by software
              by writing 0. It is recommended to check and then
              clear TSOVF only after clearing the TSF bit.
              Otherwise, an overflow might not be noticed if a
              time-stamp event occurs immediately before the TSF
              bit is cleared.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMP1F</name>
              <description>RTC_TAMP1 detection flag This flag is
              set by hardware when a tamper detection event is
              detected on the RTC_TAMP1 input. It is cleared by
              software writing 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMP2F</name>
              <description>RTC_TAMP2 detection flag This flag is
              set by hardware when a tamper detection event is
              detected on the RTC_TAMP2 input. It is cleared by
              software writing 0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMP3F</name>
              <description>RTC_TAMP3 detection flag This flag is
              set by hardware when a tamper detection event is
              detected on the RTC_TAMP3 input. It is cleared by
              software writing 0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECALPF</name>
              <description>Recalibration pending Flag The RECALPF
              status flag is automatically set to 1 when software
              writes to the RTC_CALR register, indicating that the
              RTC_CALR register is blocked. When the new
              calibration settings are taken into account, this bit
              returns to 0. Refer to Re-calibration
              on-the-fly.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITSF</name>
              <description>Internal tTime-stamp flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_PRER</name>
          <displayName>RTC_PRER</displayName>
          <description>This register must be written in
          initialization mode only. The initialization must be
          performed in two separate write accesses. Refer to
          Calendar initialization and configuration on page9.This
          register is write protected. The write access procedure
          is described in RTC register write protection on
          page9.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x007F00FF</resetValue>
          <fields>
            <field>
              <name>PREDIV_S</name>
              <description>Synchronous prescaler factor This is the
              synchronous division factor: ck_spre frequency =
              ck_apre frequency/(PREDIV_S+1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>PREDIV_A</name>
              <description>Asynchronous prescaler factor This is
              the asynchronous division factor: ck_apre frequency =
              RTCCLK frequency/(PREDIV_A+1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
