cmsis-svd/cmsis-svd/data/STMicro/STM32H723.svd
        <register>
          <name>SCAR_PRG2</name>
          <displayName>SCAR_PRG2</displayName>
          <description>FLASH secure address for bank
          2</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC_AREA_START2</name>
              <description>Bank 2 lowest secure protected address
              configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>SEC_AREA_END2</name>
              <description>Bank 2 highest secure protected address
              configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMES2</name>
              <description>Bank 2 secure protected erase enable
              option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSN_CUR2R</name>
          <displayName>WPSN_CUR2R</displayName>
          <description>FLASH write sector protection for bank
          2</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRPSn2</name>
              <description>Bank 2 sector write protection option
              status byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSN_PRG2R</name>
          <displayName>WPSN_PRG2R</displayName>
          <description>FLASH write sector protection for bank
          2</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRPSn2</name>
              <description>Bank 2 sector write protection
              configuration byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCR2</name>
          <displayName>CRCCR2</displayName>
          <description>FLASH CRC control register for bank
          1</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_SECT</name>
              <description>Bank 2 CRC sector number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ALL_BANK</name>
              <description>Bank 2 CRC select bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BY_SECT</name>
              <description>Bank 2 CRC sector mode select
              bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD_SECT</name>
              <description>Bank 2 CRC sector select
              bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_SECT</name>
              <description>Bank 2 CRC sector list clear
              bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_CRC</name>
              <description>Bank 2 CRC start bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_CRC</name>
              <description>Bank 2 CRC clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BURST</name>
              <description>Bank 2 CRC burst size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSADD2R</name>
          <displayName>CRCSADD2R</displayName>
          <description>FLASH CRC start address register for bank
          2</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_START_ADDR</name>
              <description>CRC start address on bank
              2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCEADD2R</name>
          <displayName>CRCEADD2R</displayName>
          <description>FLASH CRC end address register for bank
          2</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_END_ADDR</name>
              <description>CRC end address on bank 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_FA2R</name>
          <displayName>ECC_FA2R</displayName>
          <description>FLASH ECC fail address for bank
          2</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAIL_ECC_ADDR2</name>
              <description>Bank 2 ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
