cmsis-svd/cmsis-svd/data/STMicro/STM32H723.svd
        <register>
          <name>M5FDRL</name>
          <displayName>M5FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FDRH</name>
          <displayName>M1FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FDRH</name>
          <displayName>M2FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M3FDRH</name>
          <displayName>M3FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M4FDRH</name>
          <displayName>M4FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M5FDRH</name>
          <displayName>M5FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FECR</name>
          <displayName>M1FECR</displayName>
          <description>RAMECC monitor x failing ECC error code
          register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FECR</name>
          <displayName>M2FECR</displayName>
          <description>RAMECC monitor x failing ECC error code
          register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M3FECR</name>
          <displayName>M3FECR</displayName>
          <description>RAMECC monitor x failing ECC error code
          register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M4FECR</name>
          <displayName>M4FECR</displayName>
          <description>RAMECC monitor x failing ECC error code
          register</description>
          <alternateRegister>M4FDRH</alternateRegister>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M5FECR</name>
          <displayName>M5FECR</displayName>
          <description>RAMECC monitor x failing ECC error code
          register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
